# THIS FILE IS AUTOMATICALLY GENERATED
# Project: Z:\PSoC\Bootloadable Blinking LED.cydsn\Bootloadable Blinking LED.cyprj
# Date: Tue, 08 Sep 2015 22:50:46 GMT
#set_units -time ns
create_clock -name {CyRouted1} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {UART_IntClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 39 79} [list [get_pins {ClockBlock/udb_div_0}]]


# Component constraints for Z:\PSoC\Bootloadable Blinking LED.cydsn\TopDesign\TopDesign.cysch
# Project: Z:\PSoC\Bootloadable Blinking LED.cydsn\Bootloadable Blinking LED.cyprj
# Date: Tue, 08 Sep 2015 22:50:44 GMT
